---
title: VertexPositionColored
classe: Autodesk.Revit.DB.DirectContext3D.VertexPositionColored
namespace: Autodesk.Revit.DB.DirectContext3D
eredita: Autodesk.Revit.DB.DirectContext3D.Vertex
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# VertexPositionColored

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `XYZ Position { get; set; }` | `vertexPositionColored.Position` | XYZ |
| `ColorWithTransparency GetColor()` | `vertexPositionColored.GetColor()` | ColorWithTransparency |
| `Int32 GetSizeInFloats()` | `VertexPositionColored.GetSizeInFloats()` | Int32 |
| `Void SetColor(ColorWithTransparency)` | `vertexPositionColored.SetColor(color)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```